(function () {
    var categories = {
    saveSettings: "Απόρριψη",
    necessary: {
        title: "Απαραίτητα",
        description: "Οι απαραίτητες τεχνολογίες ιστού και τα cookies καθιστούν τον ιστότοπό μας τεχνικά προσβάσιμο και χρήσιμο για εσάς. Αυτό ισχύει για βασικές λειτουργίες όπως η πλοήγηση στον ιστότοπο, η σωστή εμφάνιση στον περιηγητή σας στο διαδίκτυο ή η αίτηση της συγκατάθεσής σας. Χωρίς αυτές τις τεχνολογίες ιστού και cookies, ο ιστότοπός μας δεν λειτουργεί."
    },
    functional: {
        title: "Λειτουργικά",
        description: "Τα λειτουργικά cookies επιτρέπουν την αποθήκευση πληροφοριών που αλλάζουν την εμφάνιση ή τη λειτουργία του ιστότοπου. Για παράδειγμα, η προτιμώμενη γλώσσα ή περιοχή σας."
    },
    statisic: {
        title: "Στατιστικά",
        description: "Θέλουμε να βελτιώνουμε συνεχώς τη χρησιμότητα και την απόδοση των ιστότοπών μας. Για το λόγο αυτό, χρησιμοποιούμε τεχνολογίες ανάλυσης (συμπεριλαμβανομένων των cookies) που μετρούν και αξιολογούν ανώνυμα ποιες λειτουργίες και περιεχόμενο των ιστότοπών μας χρησιμοποιούνται, πώς και πόσο συχνά. Με βάση αυτό, μπορούμε να βελτιώσουμε τους ιστότοπούς για τους χρήστες."
    },
    marketing: {
        title: "Μάρκετινγκ",
        description: "Χρησιμοποι    ούμε τεχνολογίες ιστού (συμπεριλαμβανομένων των cookies) από επιλεγμένους συνεργάτες για να σας δείχνουμε περιεχόμενο και διαφημίσεις ειδικά προσαρμοσμένες για εσάς σε ιστότοπους και κοινωνικά μέσα. Αυτό το περιεχόμενο επιλέγεται και εμφανίζεται με βάση τη συμπεριφορά χρήσης σας. Τα cookies διαφήμισης ή μάρκετινγκ χρησιμοποιούνται για να παρέχουν στους επισκέπτες σχετικές διαφημίσεις και εκστρατείες μάρκετινγκ. Αυτά τα cookies παρακολουθούν τους επισκέπτες σε διάφορους ιστότοπους και συλλέγουν πληροφορίες για την παροχή εξατομικευμένων διαφημίσεων."
    }
};
    var arrangeWord = (window.INTA && window.INTA.settings && window.INTA.settings.arrange == "ltr") ? "αριστερή" : "δεξιά";
    window.__intaCmpLocalePayload = {
        slug: "el",
        cookieSettingsLabel: "Ρυθμίσεις Cookies",
        showHideDetails: "Εμφάνιση λεπτομερειών",
        acceptLabel: "Αποδοχή",
        acceptShortLabel: "Αποδοχή",
        declineLabel: "Απόρριψη",
        settingsLabel: "Ρυθμίσεις",
        policyLinkLabel: "Η Πολιτική Απορρήτου και Cookies μας",
        bannerMessage: "Αποδεχόμενοι όλα τα cookies, υποστηρίζετε το " + document.domain + " στην ανάπτυξη μιας καλύτερης λύσης για εσάς.</p><p>Επιλέξτε αν θέλετε να επιτρέψετε μόνο τα απαραίτητα cookies ή αν θέλετε να επιτρέψετε όλα τα cookies.",
        settingsMessage: "<h3 style=\"    font-size: 25px;\">Είστε σε έλεγχο</h3>"
            + "<p>Εμείς και οι επιχειρηματικοί μας συνεργάτες χρησιμοποιούμε τεχνολογίες, όπως τα cookies, για να συλλέγουμε πληροφορίες για"
            + "εσάς για διάφορους σκοπούς, συμπεριλαμβανομένων:</p>"
            + "<ol>"
            + "<li>Λειτουργικότητα</li>"
            + "<li>Στατιστικά</li>"
            + "<li>Διαφήμιση</li>"
            + "</ol>"
            + "<p>Κάνοντας κλικ στο \"Αποδοχή\", συναινείτε σε όλους αυτούς τους σκοπούς. Μπορείτε επίσης να επιλέξετε τους συγκεκριμένους σκοπούς στους οποίους συμφωνείτε, επιλέγοντας τα πλαί"
            + "ς δίπλα στον σκοπό και κάνοντας κλικ στο \"Αποθήκευση ρυθμίσεων\".</p>"
            + "<p>Μπορείτε να ανακαλέσετε τη συγκατάθεσή σας ανά πάσα στιγμή κάνοντας κλικ στο μικρό εικονίδιο στην κάτω " + arrangeWord + " γωνία της ιστοσελίδας.</p>",
        settingsMessageSuffix: '<button onClick="showPrivacy()" class="intastellarCookie-settings__privacyLink">Intastellar Solutions, International πολιτική απορρήτου</button>',
        categories: categories
    };
})();
